# Part 2
For part 2 of the project, you will be engineering a MySQL database for your IMDB movie data. You will examine the data to determine the correct SQL data type and size for each column. You will then construct the ERD and forward engineer the database. Finally, you will insert your IMDB data into your database from a jupyter notebook.

## Specifications - Database
Your stakeholder wants you to take your data from Part 1 of the project and to create a MySQL database with the requested columns/features.
Specifically, they would like the following tables and columns included in your database:

A "title_basics" table, which contains:
- tconst (as the primary key)
- primary_title
- start_year
- runtime

A "ratings" table, which contains::
- tconst (as the primary key)
- average_rating
- number_of_votes

They want the Genres from title basics included in the database, but they want the tables normalized. You will learn how to process and normalize the genres next week. For now, you will include the tables in your database, but will not insert any data until Part 3.

A "genres" table, which includes:
- genre_id (New): a numeric ID for each genre (primary key)
- genre_name (New): the full name of each genre

A "title_genres" table (or "title_has_genres" table), which includes:
- tconst
- genre_id

Hint: let MySQL's ERD editor help you create this table.

In [1]:
import pandas as pd
import json, os

In [2]:
os.listdir("Data/")

['title-ratings.csv',
 'movies erd.png',
 'title.basics.tsv.gz',
 'movies.sql',
 'title.ratings.tsv.gz',
 'title-akas-us-only.csv',
 'movies erd.mwb',
 '.ipynb_checkpoints',
 'title-basics.csv']

In [3]:
# Load in data for basics
basics = pd.read_csv('Data/title-basics.csv')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [4]:
# Load in data for ratings
ratings = pd.read_csv('Data/title-ratings.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [5]:
def string_lengths(df):
    print("\nSTRING COLUMN MAX LENGTHS:")
    for col in df.select_dtypes('object').columns:
        length =  df[col].fillna('').map(len).max()
        print(f"- {col}: {length}")

In [6]:
# Show column lengths for basics df
string_lengths(basics)

STRING COLUMN MAX LENGTHS:
- tconst: 10
- titleType: 5
- primaryTitle: 242
- originalTitle: 242
- genres: 29

In [7]:
# Show column lengths for ratings df
string_lengths(ratings)

STRING COLUMN MAX LENGTHS:
- tconst: 10

## Design the Database Model/ERD

<img src="Data/movies erd.png">

## Create the Database with your CREATE SQL script

In [9]:
# Created and ran script in mysql workbench

## Confirm the Database has been updated correctly

In [10]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [11]:
import json
with open('/Users/sherlin01/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [12]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies"
engine = create_engine(connection)

In [15]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

### title_basics

In [16]:
q = """DESCRIBE title_basics;"""
pd.read_sql(q, engine)

           Field          Type Null  Key Default Extra
0         tconst   varchar(15)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [17]:
col_map = {'tconst':'tconst',
        'primaryTitle':'primary_title',
        'startYear':'start_year',
        'runtimeMinutes':'runtime'}

basics_db = basics[col_map.keys()]
basics_db = basics_db.rename(col_map, axis=1)
basics_db

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,74
86975,tt9915872,The Last White Witch,2019.0,97
86976,tt9916170,The Rehearsal,2019.0,51
86977,tt9916190,Safeguard,2020.0,95
86978,tt9916362,Coven,2020.0,92

In [18]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     1

In [19]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
engine.execute(q)

In [20]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     0

In [22]:
basics_db.to_sql("title_basics", engine, index=False, if_exists='append')

86979

In [23]:
q = """DESCRIBE title_basics;"""
pd.read_sql(q, engine)

           Field          Type Null  Key Default Extra
0         tconst   varchar(15)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [24]:
# Viewing first five rows from title_basics
q = """SELECT * FROM title_basics LIMIT 5"""
pd.read_sql(q, engine)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

### title_ratings

In [25]:
q = """DESCRIBE ratings;"""
pd.read_sql(q, engine)

             Field         Type Null  Key Default Extra
0           tconst     char(15)   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

In [26]:
col_map = {'tconst':'tconst',
        'averageRating':'average_rating',
        'numVotes':'number_of_votes',
          }

ratings_db = ratings[col_map.keys()]
ratings_db = ratings_db.rename(col_map, axis=1)
ratings_db

          tconst  average_rating  number_of_votes
0      tt0035423             6.4            87153
1      tt0062336             6.4              175
2      tt0069049             6.7             7754
3      tt0088751             5.2              336
4      tt0096056             5.6              846
...          ...             ...              ...
71895  tt9914942             6.6              178
71896  tt9915872             6.4                9
71897  tt9916170             7.0                7
71898  tt9916190             3.7              243
71899  tt9916362             6.4             5422

[71900 rows x 3 columns]

In [27]:
ratings_db.to_sql("ratings", engine, index=False, if_exists='append')

71900

In [28]:
q = """DESCRIBE ratings;"""
pd.read_sql(q, engine)

             Field         Type Null  Key Default Extra
0           tconst     char(15)   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

In [29]:
# Viewing first five rows from title_ratings
q = """SELECT * FROM ratings LIMIT 5"""
pd.read_sql(q, engine)

      tconst average_rating  number_of_votes
0  tt0035423            6.4            87153
1  tt0062336            6.4              175
2  tt0069049            6.7             7754
3  tt0088751            5.2              336
4  tt0096056            5.6              846